{
    "training":[
        {"text": "How do you spell the word 'beautiful'","label": "english"},
        {"text": "Why do some words sound the same but have different meanings","label": "english"},
        {"text": "Can you explain what a noun is","label": "english"},
        {"text": "What makes a sentence complete","label": "english"},
        {"text": "How do you know when to use 'their' or 'there'","label": "english"},
        {"text": "Why do we use punctuation like commas and periods","label": "english"},
        {"text": "What is the difference between a simile and a metaphor","label": "english"},
        {"text": "How do you find the main idea of a story","label": "english"},
        {"text": "Why do we capitalize proper nouns","label": "english"},
        {"text": "Can a sentence start with 'and' or 'but'","label": "english"},
        {"text": "How do you use quotation marks in dialogue","label": "english"},
        {"text": "What is an adjective and how does it work?","label": "english"},
        {"text": "Why does rhyming help in poems","label": "english"},
        {"text": "How do you identify the subject and predicate","label": "english"},
        {"text": "Why are synonyms and antonyms important?","label": "english"},
        {"text": "What is the difference between past and present participle","label": "english"},
        {"text": "Can you explain what an idiom means?","label": "english"},
        {"text": "How do you know if a sentence is a question or a command","label": "english"},
        {"text": "What is a prefix and how does it change a word","label": "english"},
        {"text": "Why do authors use figurative language?","label": "english"},
        {"text": "How many apples do I have if I start with 3 and add 2 more","label": "maths"},
        {"text": "Why is 7 bigger than 5","label": "maths"},
        {"text": "If I have 10 candies and give away 4, how many are left?","label": "maths"},
        {"text": "What shape has three sides and three corners?","label": "maths"},
        {"text": "Why do we need to learn multiplication tables","label": "maths"},
        {"text": "How do you find the area of a rectangle","label": "maths"},
        {"text": "What is the difference between factors and multiples","label": "maths"},
        {"text": "Why is dividing by zero not allowed","label": "maths"},
        {"text": "How can I tell if a number is prime","label": "maths"},
        {"text": "How do you change a fraction into a decimal","label": "maths"},
        {"text": "Can you explain what a negative number means","label": "maths"},
        {"text": "How do I solve 2x + 3 = 9","label": "maths"},
        {"text": "Why does a triangle's angles always add up to 180 degrees?","label": "maths"},
        {"text": "What is the slope of a line and how do I find it","label": "maths"},
        {"text": "How can I use the quadratic formula","label": "maths"},
        {"text": "What's the difference between permutations and combinations","label": "maths"},
        {"text": "Why does the Pythagorean theorem work","label": "maths"},
        {"text": "Can you explain what a derivative is?","label": "maths"},
        {"text": "How do integrals undo derivatives?","label": "maths"},
        {"text": "Why are sine, cosine, and tangent important in trigonometry?","label": "maths"},
        {"text": "Why do leaves change color in autumn","label": "science"},
        {"text": "How do seeds grow into plants","label": "science"},
        {"text": "Why do some rivers form deltas when they reach the sea?","label": "science"},
        {"text": "Can animals survive without water","label": "science"},
        {"text": "How many molecules are in 2 moles of water?","label": "science"},
        {"text": "What does m stand for in the formula for force F = m * a","label": "science"},
        {"text": "How do you calculate the voltage across a resistor with resistance 5 Ohms and 2 Amps of current","label": "science"},
        {"text": "Hans ran a marathon in 3 hours. What was his average speed during his run","label": "science"},
        {"text": "Explain why ice floats on water?","label": "science"},
        {"text": "How do magnets attract or repel each other","label": "science"},
        {"text": "How does photosynthesis convert sunlight into chemical energy?","label": "science"},
        {"text": "What is the difference between renewable and non-renewable energy","label": "science"},
        {"text": "Why do we have day and night","label": "science"},
        {"text": "How do you balance a chemical equation","label": "science"},
        {"text": "What causes earthquakes and how are they measured","label": "science"},
        {"text": "A particle of mass 2 kg moves under a net force F = 4t N. What is its velocity after 3 seconds?","label": "science"},
        {"text": "Can you describe the life cycle of a butterfly","label": "science"},
        {"text": "How does electricity flow through a simple circuit","label": "science"},
        {"text": "If a 5 kg object is pushed with a force of 20 N, what is its acceleration","label": "science"},
        {"text": "How does the water cycle move water through the environment","label": "science"}
    ],
    "validation":[
        {"text": "Why does the author use metaphors in this poem","label": "english"},
        {"text": "What is the difference between a noun and a verb","label": "english"},
        {"text": "What are fractions used for in real life","label": "maths"},
        {"text": "Can you show me how to count to 20 using blocks","label": "maths"},
        {"text": "How do you measure the density of a liquid","label": "science"},
        {"text": "Why do stars twinkle in the night sky","label": "science"}
    ],
    "testing":[
        {"text": "Can you tell me what the main idea of the story is","label": "english"},
        {"text": "Who was the first president of the United States","label": "english"},
        {"text": "How does Shakespeare show conflict between characters in Romeo and Juliet","label": "english"},
        {"text": "If you have 8 apples and eat 3, how many are left","label": "maths"},
        {"text": "What is the value of x in the equation 2x + 5 = 11","label": "maths"},
        {"text": "How many degrees are in the interior angles of a hexagon","label": "maths"},
        {"text": "Why do plants need sunlight to grow","label": "science"},
        {"text": "If a car travels 100 km in 2 hours what is its average speed","label": "science"},
        {"text": "How many protons are there in a carbon atom","label": "science"}
    ]
}